*SRCMBRTXT:Contabilidad Automática                
     C                   MOVE      *ON           MODE              1
     C                   CALL      'COSJ00RG'
     C                   PARM                    MODE
     C                   SETON                                        LR
