*SRCMBRTXT:Link-Host to Host-Constantes con Nombre
     D*-------------------------------------------------------------------------
     D* Constantes
     D*-------------------------------------------------------------------------
     D*-------------------------------------------
     D* Conexion
     C*-------------------------------------------
     D* ... Estados
     D CO_STOFFLINE    C                   CONST('0')
     D CO_STONLINE     C                   CONST('1')
     D* ... Comandos
     D CO_CMNOCMD      C                   CONST(' ')
     D CO_CMQUIT       C                   CONST('1')
     D CO_CMLOGON      C                   CONST('2')
     D CO_CMLOGOFF     C                   CONST('3')
     D CO_CMNOTIFY     C                   CONST('4')
     D*-------------------------------------------
     D* Adm de Mensajes
     C*-------------------------------------------
     D AM_CMPRCMSG     C                   CONST(' ')
     D AM_CMGENLOGON   C                   CONST('1')
     D AM_CMGENLOGOFF  C                   CONST('2')

     D*-------------------------------------------
     D* Constantes con Nombres de Campos
     D*-------------------------------------------
     D sec_bitmap      C                   CONST(  1)
     D pan             C                   CONST(  2)
     D proc_cde        C                   CONST(  3)
     D tran_amt        C                   CONST(  4)
     D srtl_amt        C                   CONST(  5)
     D bill_amt        C                   CONST(  6)
     D xmit_dat_tim    C                   CONST(  7)
     D bill_fee        C                   CONST(  8)
     D setl_conv_rat   C                   CONST(  9)
     D bill_conv_rat   C                   CONST( 10)
     D trace_num       C                   CONST( 11)
     D tran_tim        C                   CONST( 12)
     D tran_dat        C                   CONST( 13)
     D exp_dat         C                   CONST( 14)
     D setl_dat        C                   CONST( 15)
     D conv_dat        C                   CONST( 16)
     D cap_dat         C                   CONST( 17)
     D mrcht_typ_cde   C                   CONST( 18)
     D acqins_cntryc   C                   CONST( 19)
     D panext_cntryc   C                   CONST( 20)
     D frwdin_cntryc   C                   CONST( 21)
     D entry_mde       C                   CONST( 22)
     D mbr_num         C                   CONST( 23)
     D netw_intl_id    C                   CONST( 24)
     D pttran_spclcde  C                   CONST( 25)
     D pospin_captcde  C                   CONST( 26)
     D authid_resplen  C                   CONST( 27)
     D tran_fee        C                   CONST( 28)
     D setl_fee        C                   CONST( 29)
     D tran_proc_fee   C                   CONST( 30)
     D setl_proc_fee   C                   CONST( 31)
     D acq_inst_id     C                   CONST( 32)
     D frwd_inst_id    C                   CONST( 33)
     D pan_extnd       C                   CONST( 34)
     D track           C                   CONST( 35)
     D track_3         C                   CONST( 36)
     D retrvl_ref_num  C                   CONST( 37)
     D auth_id_resp    C                   CONST( 38)
     D resp_cde        C                   CONST( 39)
     D service_cde     C                   CONST( 40)
     D term_id         C                   CONST( 41)
     D crd_accpt_idc   C                   CONST( 42)
     D crdaccpt_nmel   C                   CONST( 43)
     D resp_data       C                   CONST( 44)
     D track_1         C                   CONST( 45)
     D add_data_iso    C                   CONST( 46)
     D add_data_natl   C                   CONST( 47)
     D add_data_prvt   C                   CONST( 48)
     D crncy_cde       C                   CONST( 49)
     D setl_crncy      C                   CONST( 50)
     D bill_crncy      C                   CONST( 51)
     D pin             C                   CONST( 52)
     D sec_cntrl_info  C                   CONST( 53)
     D add_amts        C                   CONST( 54)
     D pri_rsrvd1_iso  C                   CONST( 55)
     D pri_rsrvd2_iso  C                   CONST( 56)
     D pri_rsrvd1_nat  C                   CONST( 57)
     D pri_rsrvd2_nat  C                   CONST( 58)
     D pri_rsrvd3_nat  C                   CONST( 59)
     D pri_rsrvd1_prv  C                   CONST( 60)
     D pri_rsrvd2_prv  C                   CONST( 61)
     D pri_rsrvd3_prv  C                   CONST( 62)
     D pri_rsrvd4_prv  C                   CONST( 63)
     D pri_mac_cde     C                   CONST( 64)
     D reserved        C                   CONST( 65)
     D setl_cde        C                   CONST( 66)
     D extd_pay_cde    C                   CONST( 67)
     D rcvins_cntryc   C                   CONST( 68)
     D setins_cntryc   C                   CONST( 69)
     D netw_mgmt_cde   C                   CONST( 70)
     D msg_num         C                   CONST( 71)
     D lst_msg_num     C                   CONST( 72)
     D action_dat      C                   CONST( 73)
     D num_cr          C                   CONST( 74)
     D num_cr_rvsl     C                   CONST( 75)
     D num_db          C                   CONST( 76)
     D num_db_rvsl     C                   CONST( 77)
     D num_xfer        C                   CONST( 78)
     D num_xfer_rvsl   C                   CONST( 79)
     D num_inq         C                   CONST( 80)
     D num_auth        C                   CONST( 81)
     D amt_cr_procfee  C                   CONST( 82)
     D amt_cr_tranfee  C                   CONST( 83)
     D amt_db_procfee  C                   CONST( 84)
     D amt_db_tranfee  C                   CONST( 85)
     D amt_cr          C                   CONST( 86)
     D amt_cr_rvsl     C                   CONST( 87)
     D amt_db          C                   CONST( 88)
     D amt_db_rvsl     C                   CONST( 89)
     D orig_info       C                   CONST( 90)
     D file_updt_cde   C                   CONST( 91)
     D file_sec_cde    C                   CONST( 92)
     D resp_ind        C                   CONST( 93)
     D srv_ind         C                   CONST( 94)
     D replacement     C                   CONST( 95)
     D msg_sec_cde     C                   CONST( 96)
     D setl_amt_net    C                   CONST( 97)
     D payee           C                   CONST( 98)
     D setl_inst       C                   CONST( 99)
     D rcv_inst        C                   CONST(100)
     D fname           C                   CONST(101)
     D acct1           C                   CONST(102)
     D acct2           C                   CONST(103)
     D tran_descr      C                   CONST(104)
     D sec_rsrvd1_iso  C                   CONST(105)
     D sec_rsrvd2_iso  C                   CONST(106)
     D sec_rsrvd3_iso  C                   CONST(107)
     D sec_rsrvd4_iso  C                   CONST(108)
     D sec_rsrvd5_iso  C                   CONST(109)
     D sec_rsrvd6_iso  C                   CONST(110)
     D sec_rsrvd7_iso  C                   CONST(111)
     D sec_rsrvd1_nat  C                   CONST(112)
     D sec_rsrvd2_nat  C                   CONST(113)
     D sec_rsrvd3_nat  C                   CONST(114)
     D sec_rsrvd4_nat  C                   CONST(115)
     D sec_rsrvd5_nat  C                   CONST(116)
     D sec_rsrvd6_nat  C                   CONST(117)
     D sec_rsrvd7_nat  C                   CONST(118)
     D sec_rsrvd8_nat  C                   CONST(119)
     D sec_rsrvd1_prv  C                   CONST(120)
     D sec_rsrvd2_prv  C                   CONST(121)
     D sec_rsrvd3_prv  C                   CONST(122)
     D sec_rsrvd4_prv  C                   CONST(123)
     D sec_rsrvd5_prv  C                   CONST(124)
     D sec_rsrvd6_prv  C                   CONST(125)
     D sec_rsrvd7_prv  C                   CONST(126)
     D sec_rsrvd8_prv  C                   CONST(127)
     D sec_mac_cde     C                   CONST(128)
