*SRCMBRTXT:ELIMINO ASTERISCOS DEL STRING          
     C     *ENTRY        PLIST
     C                   PARM                    TEXTO          1000
     C     '*':' '       XLATE     TEXTO         TEXTO
     C                   SETON                                        LR
